erp3l/src/DataProcessors/АналитическийБланкСводнаяТаблица/АналитическийБланкСводнаяТаблица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АналитическийБланкСводнаяТаблица</name>
  <tabularSections>
    <name>ТаблицаИзмененныхПоказателей</name>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.Сценарии</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОтчета</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательОтчета</name>
      <type>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>CatalogRef.ПроизвольныйКлассификаторУХ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходноеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаВалюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеВалюта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СинтетическоеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеЗаблокировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексСостояния</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

erp3l/src/Enums/ВидыКолонокСводнойТаблицы/ВидыКолонокСводнойТаблицы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКолонокСводнойТаблицы</name>
  <enumValues>
    <name>БазовоеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ОтклонениеАБС</name>
  </enumValues>
  <enumValues>
    <name>ОтклонениеОтн</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <comment>(-УХПредставлениеСписка)(-УХПредставлениеОбъекта)</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроектЭтапа</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтатьяДоходовИРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОсновнаяВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВалютаПлатежей</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесовойКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_СметнаяСтоимостьБазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_СметнаяСтоимостьТекущая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделИнвестиционнойПрограммы</name>
    <type>
      <types>CatalogRef.РазделыИнвестиционныхПрограмм</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФункциональноеНаправление</name>
    <type>
      <types>CatalogRef.ФункциональныеНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтавкаДисконтирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПартнерыИКонтактныеЛица</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>РольПартнера</name>
      <type>
        <types>CatalogRef.РолиПартнеровВСделкахИПроектах</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроектыПредшественники</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/DataProcessors/АналитическийБланкСводнаяТаблица/Forms/ФормаНастройкиКолонок/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиСоставаСтрокСводнойТаблицыАдрес = Параметры.НастройкиСоставаСтрокСводнойТаблицыАдрес;

	НастройкиСоставаСтрокСводнойТаблицы      = ПолучитьИзВременногоХранилища(НастройкиСоставаСтрокСводнойТаблицыАдрес);
	
	ЗаполнитьОграничениеВыбораПоВидамОтчетов(НастройкиСоставаСтрокСводнойТаблицы);
		
	НастройкиСоставаКолонокСводнойТаблицы.Загрузить(ПолучитьИзВременногоХранилища(Параметры.НастройкиСоставаКолонокСводнойТаблицыАдрес));
	
	Для Каждого Кол Из НастройкиСоставаКолонокСводнойТаблицы Цикл
		
		Если ЗначениеЗаполнено(Кол.ПериодОтчета) Тогда
			
			Кол.ПериодПредставление = Кол.ПериодОтчета;
			
		ИначеЕсли ЗначениеЗаполнено(Кол.ПериодСдвиг) Тогда 	
			
			Кол.ПериодПредставление = Нстр("ru = 'Сдвиг по периоду: '") + Строка(Кол.ПериодСдвиг);
	
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОграничениеВыбораПоВидамОтчетов(НастройкиСоставаСтрокСводнойТаблицы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкиСоставаСтрокСводнойТаблицы.СтрокаОтчета КАК СтрокаОтчета
	|ПОМЕСТИТЬ втНастройкиСоставаСтрокСводнойТаблицы
	|ИЗ
	|	&НастройкиСоставаСтрокСводнойТаблицы КАК НастройкиСоставаСтрокСводнойТаблицы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ (втНастройкиСоставаСтрокСводнойТаблицы.СтрокаОтчета КАК Справочник.СтрокиОтчетов).Владелец КАК ВидОтчета
	|ИЗ
	|	втНастройкиСоставаСтрокСводнойТаблицы КАК втНастройкиСоставаСтрокСводнойТаблицы";
	
	Запрос.УстановитьПараметр("НастройкиСоставаСтрокСводнойТаблицы",НастройкиСоставаСтрокСводнойТаблицы);
	
	ВидыОтчетовМассив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидОтчета");
	ВидыОтчетовСписок.ЗагрузитьЗначения(ВидыОтчетовМассив);
	
	МассивЗнченийПараметров  = Новый ФиксированныйМассив(ВидыОтчетовМассив);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", МассивЗнченийПараметров);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.НастройкиСоставаКолонокСводнойТаблицыКолонкаОтчета.ПараметрыВыбора = НовыеПараметры;

	  
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСоставаКолонокСводнойТаблицыКолонкаОтчетаПриИзменении(Элемент)
	 
	Элементы.НастройкиСоставаКолонокСводнойТаблицы.ТекущиеДанные.ПредставлениеКолонки  = Строка(Элементы.НастройкиСоставаКолонокСводнойТаблицы.ТекущиеДанные.КолонкаОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСоставаКолонокСводнойТаблицыПриИзменении(Элемент)
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТипКолонки) Тогда	
			Элемент.ТекущиеДанные.ПризнакИспользования    = Истина;
			Элемент.ТекущиеДанные.ТипКолонки = ПредопределенноеЗначение("Перечисление.ВидыКолонокСводнойТаблицы.БазовоеЗначение");
		КонецЕсли;		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСоставаКолонокСводнойТаблицыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИмяПоля = СтрЗаменить(Поле.Имя,"НастройкиСоставаКолонокСводнойТаблицы","");
		
	Если ИмяПоля = "Сценарий" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыВыбора = Новый Структура("ИмяПоля",ИмяПоля);
	    ОповещениеВыборИзМенюОкончание = Новый ОписаниеОповещения("ВыборИзМенюОкончание",ЭтаФорма,ПараметрыВыбора);
				
		СписокДоступныхЗначений = Новый СписокЗначений;
		СписокДоступныхЗначений.Добавить(Нстр("ru = 'Значение'"));
		СписокДоступныхЗначений.Добавить(Нстр("ru = 'Значение контекста'"));
		
		ЭтаФорма.ПоказатьВыборИзМеню(ОповещениеВыборИзМенюОкончание,СписокДоступныхЗначений,Элемент);
			
	ИначеЕсли ИмяПоля = "ПериодПредставление" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыВыбора = Новый Структура("ИмяПоля",ИмяПоля);
	    ОповещениеВыборИзМенюОкончание = Новый ОписаниеОповещения("ВыборИзМенюОкончание",ЭтаФорма,ПараметрыВыбора);
				
		СписокДоступныхЗначений = Новый СписокЗначений;
		СписокДоступныхЗначений.Добавить(Нстр("ru = 'Сдвиг по периоду источника'"));
		СписокДоступныхЗначений.Добавить(Нстр("ru = 'Значение контекста'"));

		ЭтаФорма.ПоказатьВыборИзМеню(ОповещениеВыборИзМенюОкончание,СписокДоступныхЗначений,Элемент);
			
	ИначеЕсли ИмяПоля = "Организация" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыВыбора = Новый Структура("ИмяПоля",ИмяПоля);
	    ОповещениеВыборИзМенюОкончание = Новый ОписаниеОповещения("ВыборИзМенюОкончание",ЭтаФорма,ПараметрыВыбора);
				
		СписокДоступныхЗначений = Новый СписокЗначений;
		СписокДоступныхЗначений.Добавить(Нстр("ru = 'Значение'"));
		СписокДоступныхЗначений.Добавить(Нстр("ru = 'Значение контекста'"));
		
		ЭтаФорма.ПоказатьВыборИзМеню(ОповещениеВыборИзМенюОкончание,СписокДоступныхЗначений,Элемент);
		
	ИначеЕсли ИмяПоля = "Проект" Тогда
	
		СтандартнаяОбработка = Ложь;
			
		ПараметрыВыбора = Новый Структура("ИмяПоля",ИмяПоля);
	    ОповещениеВыборИзМенюОкончание = Новый ОписаниеОповещения("ВыборИзМенюОкончание",ЭтаФорма,ПараметрыВыбора);
				
		СписокДоступныхЗначений = Новый СписокЗначений;
		СписокДоступныхЗначений.Добавить(Нстр("ru = 'Значение'"));
		СписокДоступныхЗначений.Добавить(Нстр("ru = 'Значение контекста'"));
		
		ЭтаФорма.ПоказатьВыборИзМеню(ОповещениеВыборИзМенюОкончание,СписокДоступныхЗначений,Элемент);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыборИзМенюОкончание(Результат, ДополнительныеПараметры) Экспорт
	
	ИмяПоля = ДополнительныеПараметры.ИмяПоля;
	ТекущийВыбор = Результат;
	
	Если ИмяПоля = "Сценарий" Тогда
		
		Если ТекущийВыбор = Неопределено Тогда
			Возврат;
		ИначеЕсли ТекущийВыбор.Значение =Нстр("ru = 'Значение контекста'") Тогда 
			Элементы.НастройкиСоставаКолонокСводнойТаблицы.ТекущиеДанные[ИмяПоля] = ПредопределенноеЗначение("Справочник.Сценарии.ПустаяСсылка");	
		ИначеЕсли  ТекущийВыбор.Значение =Нстр("ru = 'Значение'") Тогда 	
			Оповещение = Новый ОписаниеОповещения("ВыборАналитикЗавершение", ЭтаФорма);
			ОткрытьФорму("Справочник.Сценарии.ФормаВыбора",,,,,,Оповещение);	
		КонецЕсли;
			
	ИначеЕсли ИмяПоля = "ПериодПредставление" Тогда
			
		Если ТекущийВыбор = Неопределено Тогда
			Возврат;
	    ИначеЕсли ТекущийВыбор.Значение =Нстр("ru = 'Значение контекста'") Тогда 
			Элементы.НастройкиСоставаКолонокСводнойТаблицы.ТекущиеДанные[ИмяПоля] 			= ПредопределенноеЗначение("Справочник.Периоды.ПустаяСсылка");	
			Элементы.НастройкиСоставаКолонокСводнойТаблицы.ТекущиеДанные["ПериодСдвиг"]	 	= 0;
            Элементы.НастройкиСоставаКолонокСводнойТаблицы.ТекущиеДанные["ПериодОтчета"] 	= ПредопределенноеЗначение("Справочник.Периоды.ПустаяСсылка");
		ИначеЕсли  ТекущийВыбор.Значение =Нстр("ru = 'Значение'") Тогда 	
			Оповещение = Новый ОписаниеОповещения("ВыборАналитикЗавершение", ЭтаФорма);
			ОткрытьФорму("Справочник.Периоды.ФормаВыбора",,,,,,Оповещение);	
		ИначеЕсли ТекущийВыбор.Значение = Нстр("ru = 'Сдвиг по периоду источника'") Тогда 
	        Оповещение = Новый ОписаниеОповещения("ВыборАналитикЗавершение", ЭтаФорма);
			тЧисло     = Элементы.НастройкиСоставаКолонокСводнойТаблицы.ТекущиеДанные["ПериодСдвиг"];	
			ПоказатьВводчисла(Оповещение, тЧисло, НСтр("ru = 'Введите сдвиг по периоду'"), 2, 0);
		КонецЕсли;
		
	ИначеЕсли ИмяПоля = "Организация" Тогда
		
		Если ТекущийВыбор = Неопределено Тогда
			Возврат;
		ИначеЕсли ТекущийВыбор.Значение =Нстр("ru = 'Значение контекста'") Тогда 
			Элементы.НастройкиСоставаКолонокСводнойТаблицы.ТекущиеДанные[ИмяПоля] = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");	
		ИначеЕсли  ТекущийВыбор.Значение =Нстр("ru = 'Значение'") Тогда 	
			Оповещение = Новый ОписаниеОповещения("ВыборАналитикЗавершение", ЭтаФорма);
			ОткрытьФорму("Справочник.Организации.ФормаВыбора",,,,,,Оповещение);		
		КонецЕсли;	
		
	ИначеЕсли ИмяПоля = "Проект" Тогда
	
		Если ТекущийВыбор = Неопределено Тогда
			Возврат;
		ИначеЕсли ТекущийВыбор.Значение =Нстр("ru = 'Значение контекста'") Тогда 
			Элементы.НастройкиСоставаКолонокСводнойТаблицы.ТекущиеДанные[ИмяПоля] = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");	
		ИначеЕсли  ТекущийВыбор.Значение =Нстр("ru = 'Значение'") Тогда 	
			Оповещение = Новый ОписаниеОповещения("ВыборАналитикЗавершение", ЭтаФорма);
			ОткрытьФорму("Справочник.Проекты.ФормаВыбора",,,,,,Оповещение);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборАналитикЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекущаяКолонкаИмя = СтрЗаменить(Элементы.НастройкиСоставаКолонокСводнойТаблицы.ТекущийЭлемент.Имя,"НастройкиСоставаКолонокСводнойТаблицы","");
	
	Если ТипЗнч(Результат) = Тип("Число") Тогда
		
		Если Результат = 0 Тогда	
			Элементы.НастройкиСоставаКолонокСводнойТаблицы.ТекущиеДанные["ПериодОтчета"] 		= Результат;
			Элементы.НастройкиСоставаКолонокСводнойТаблицы.ТекущиеДанные["ПериодСдвиг"]	 		= 0;
			Результат = ПредопределенноеЗначение("Справочник.Периоды.ПустаяСсылка");
			Элементы.НастройкиСоставаКолонокСводнойТаблицы.ТекущиеДанные[ТекущаяКолонкаИмя] 	= Результат;	
		Иначе	 
			Элементы.НастройкиСоставаКолонокСводнойТаблицы.ТекущиеДанные["ПериодСдвиг"]	 		= Результат;
			Элементы.НастройкиСоставаКолонокСводнойТаблицы.ТекущиеДанные["ПериодОтчета"]		= ПредопределенноеЗначение("Справочник.Периоды.ПустаяСсылка");
			Результат = Нстр("ru = 'Сдвиг по периоду: '") + Строка(Результат);
			Элементы.НастройкиСоставаКолонокСводнойТаблицы.ТекущиеДанные[ТекущаяКолонкаИмя] 	= Результат;		
		КонецЕсли;	
				
	Иначе	
		
		Элементы.НастройкиСоставаКолонокСводнойТаблицы.ТекущиеДанные[ТекущаяКолонкаИмя] 		= Результат;	
	
	КонецЕсли;	
	
		
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИзменения(Команда)
	
	ПрименитьИзмененияСервер();
	Закрыть(Новый Структура("Изменено,НастройкиСоставаКолонокСводнойТаблицыАдрес",Истина,НастройкиСоставаКолонокСводнойТаблицыАдрес));
		
КонецПроцедуры

&НаСервере
Процедура ПрименитьИзмененияСервер()
				
	НастройкиСоставаКолонокСводнойТаблицы_ = РеквизитФормыВЗначение("НастройкиСоставаКолонокСводнойТаблицы");
		
	НомерПоПорядку = 1;
		
	Для Каждого Стр Из НастройкиСоставаКолонокСводнойТаблицы_ Цикл				
		Стр.НомерПоПорядку  = НомерПоПорядку;
		НомерПоПорядку      = НомерПоПорядку+1;
	КонецЦикла;	
		
	НастройкиСоставаКолонокСводнойТаблицыАдрес = ПоместитьВоВременноеХранилище(НастройкиСоставаКолонокСводнойТаблицы_,Новый УникальныйИдентификатор);
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьКолонки(Команда)
	
	Если НастройкиСоставаКолонокСводнойТаблицы.Количество()>0 Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьКолонкиЗавершение",ЭтаФорма);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Текущий список колонок будет перезаполнен, продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе	
		ЗаполнитьКолонкиСервер();
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКолонкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда		
		 ЗаполнитьКолонкиСервер();	
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКолонкиСервер()
	
	НастройкиСоставаКолонокСводнойТаблицы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КолонкиОтчетов.Ссылка КАК Ссылка,
	|	КолонкиОтчетов.Наименование КАК Наименование
	|ИЗ
	|	Справочник.КолонкиОтчетов КАК КолонкиОтчетов
	|ГДЕ
	|	КолонкиОтчетов.Владелец В(&Владелец)
	|	И КолонкиОтчетов.ПометкаУдаления = Ложь
	|
	|УПОРЯДОЧИТЬ ПО
	|	КолонкиОтчетов.Владелец.Код,
	|	КолонкиОтчетов.ПорядковыйНомер";
	
	Запрос.УстановитьПараметр("Владелец",ВидыОтчетовСписок.ВыгрузитьЗначения());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		 нКолонка = НастройкиСоставаКолонокСводнойТаблицы.Добавить();
		 нКолонка.КолонкаОтчета 			= Выборка.Ссылка;
		 нКолонка.ПредставлениеКолонки      = Выборка.Наименование;
		 нКолонка.ПризнакИспользования      = Истина;
		 нКолонка.ТипКолонки                = Перечисления.ВидыКолонокСводнойТаблицы.БазовоеЗначение;
		 
	КонецЦикла;
	
	
КонецПроцедуры
